portfolio/app/controllers/posts_controller.rb

	def show
		@post = Post.find(params[:id])
		@posts = Post.order("created_at desc").limit(4).offset(1)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 1]]